// {
//     "AI/ML Specialist": {
//         "desc": "Machine learning specialists help to solve business challenges by developing and devices can learn from data and adapt to help businesses make better decisions and predictions.",
//         "salary": 350000,
//         "path": [
//             "Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science.",
//             "Develop a strong foundation in mathematics, statistics, and programming languages like Python, which is widely used in AI/ML.", 
//             "Bachelor's Degree in AI/ML:Pursue a Bachelor's degree in Computer Science, Data Science, Artificial Intelligence, or a related field from a reputable university.",
//             "Gain hands-on experience by working on AI/ML projects, either individually or as part of academic coursework.",
//             "Participate in hackathons, competitions, or research projects related to AI/ML to apply theoretical knowledge in real-world scenarios.",
//             "Advanced Studies and Specialization:Consider pursuing a Master's degree or higher education in AI/ML for in-depth knowledge and specialization."
//         ],
//         "Certifications": [
//             "Obtain certifications in AI/ML from reputable organizations or platforms like Coursera, edX, or Udacity to validate your skills.",
//             "Develop proficiency in tools and libraries commonly used in AI/ML such as TensorFlow, PyTorch, scikit-learn, and Keras."
//         ],   
//         "Exams": [
//             "Prepare for competitive exams like GRE (Graduate Record Examination) or GATE (Graduate Aptitude Test in Engineering) if planning to pursue higher education abroad or in India, respectively.",
//             "Participate in AI/ML competitions such as Kaggle competitions to showcase your skills and learn from real-world datasets and challenges."
//         ]
//     },
//     "API Integration Specialist": {
//         "desc": "Designing, implementing, and testing API integrations based on system requirements. Communicating risks, issues, challenges and status/ progress of the project. Documenting requirements, design, architecture, and test scripts.",
//         "path": [
//             "Educational Pathway:Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science. Develop a solid understanding of computer programming, data structures, and networking fundamentals.",
//             "Bachelor's Degree in AI/ML:Pursue a Bachelor's degree in Computer Science, Information Technology, Software Engineering, or a related field from a reputable university.",
//             "Focus on courses covering web development, databases, networking, and software integration principles.",
//             "Gain hands-on experience by working on web development projects, API-based applications, or software integration projects.",
//             "Advanced Studies and Specialization:Consider pursuing a Master's degree or higher education in-depth knowledge and specialization."            ,
//         ],
//         "Certifications": [
//             "Obtain certifications in API development or integration from reputable organizations or online platforms like Udemy, Coursera, or API Academy.",
//             "Develop proficiency in programming languages commonly used for API integration such as JavaScript, Python, or Java.",
//             "Enhance your skills in tools and frameworks like Postman, Swagger, or API Gateway."
//         ],
//         "Exams": [
//             "While there may not be specific exams for API Integration, consider taking relevant certifications like AWS Certified Developer or Google Cloud - Associate Cloud Engineer, which cover aspects of cloud-based API services."
//         ]
//     },
//     "Actor": {
//         "desc": "Acting involves portraying characters in films, television, theater, or other performing arts mediums.",
//         "path": [
//             "While formal education is not mandatory, consider pursuing a Bachelor's degree in Theater Arts, Performing Arts, Film Studies, or a related field to gain foundational knowledge and skills.",
//             "Participate in school drama clubs, community theater productions, or local acting workshops to gain practical experience and build your portfolio."
//         ],
//         Acting Classes and Workshops:Enroll in acting classes, workshops, or courses offered by reputable acting schools or studios.
//         Learn techniques such as improvisation, script analysis, character development, voice modulation, and body language.
             
//              Attend auditions for local theater productions, student films, or independent projects to gain experience and exposure."    
//         ]
//     },
//     "Animator": {
//         "desc": "Animation involves creating visual effects, characters, and storytelling through moving images.
//         The scope for animators includes opportunities in films, television shows, video games, advertising, and web content.",
//         "path": [
//             "Consider pursuing a Bachelor's degree in Animation, Multimedia Arts, Visual Effects, or a related field to gain foundational knowledge and skills.
//             "Look for universities or colleges offering specialized animation programs with a focus on 2D animation, 3D animation, character design, and storytelling.
             
//             Animation Courses and Workshops:
//             Enroll in animation courses, workshops, or online tutorials offered by reputable animation schools, studios, or platforms.
//             Learn animation techniques such as keyframe animation, rigging, character animation, motion graphics, and special effects
            
//             Develop skills in drawing, illustration, storytelling, and concept art to create compelling characters and narratives.
//             Practice using animation software such as Adobe Animate, Toon Boom Harmony, Autodesk Maya, or Blender to bring your creations to life.
            
//              Certifications and Skills:Consider pursuing certifications or additional training in specialized areas such as character animation, visual effects, storyboarding, or game development to enhance your skills and marketability.
             
//              Exams and Competitions:Some animation programs or institutions may require portfolio reviews or art tests as part of the admission process."    
//         ]
//     },
//     "Application Support Engineer": {
//         "desc": "Application Support Engineers are responsible for ensuring the smooth functioning of software applications, providing technical support to users, troubleshooting issues, and resolving system errors.
//         The scope for Application Support Engineers includes opportunities in various industries such as IT services, software development companies, financial institutions, healthcare, and more.",
//         "path": [
//             "Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science.
// "
//             Pursue a Bachelor's degree in Computer Science, Information Technology, Software Engineering, or a related field from a reputable university.
//             Focus on courses covering computer programming, databases, operating systems, software development methodologies, and IT infrastructure.Technical Skills Development:Develop proficiency in programming languages such as Java, C#, Python, or SQL, depending on the requirements of the applications you'll be supporting.
//             Learn about database management systems (DBMS) such as MySQL, Oracle, or Microsoft SQL Server for troubleshooting database-related issues.
            
//             Internships and Practical Experience:Seek internships or entry-level positions in IT support roles, helpdesk support, or technical support teams to gain practical experience in providing support for software applications.
            
//              Certifications and Skills:Consider obtaining certifications relevant to application support and IT service management, such as ITIL Foundation, CompTIA A+, or Microsoft Certified: Azure Fundamentals"    
//         ]
//     },
//     "Archaeologist": {
//         "desc": "Archaeology is the study of human history and prehistory through the excavation and analysis of artifacts, structures, and other physical remains.
//         The scope for archaeologists includes opportunities in academic research, cultural heritage management, museum curation, government agencies, and consulting firms.",
//         "path": [
//             "Pursue a Bachelor's degree in Archaeology, Anthropology, History, or a related field from a reputable university.
//             "Focus on courses covering archaeological methods, fieldwork techniques, cultural heritage preservation, ancient civilizations, and research methodologies.
             
//              Fieldwork and Practical Experience:Participate in archaeological field schools, excavations, or research projects to gain hands-on experience in archaeological fieldwork and data collection.
             
//              Specialization and Research:Identify areas of specialization within archaeology such as classical archaeology, maritime archaeology, historical archaeology, or bioarchaeology based on your interests and career goals.
            
//              Advanced Studies and Specialization:Consider pursuing a Master's degree or Ph.D. in Archaeology or a related discipline to deepen your knowledge, develop specialized expertise, and enhance your research skills.
            
//              Certifications and Skills:Obtain certifications in archaeological fieldwork techniques, artifact analysis, or cultural resource management (CRM) to demonstrate proficiency in specialized areas of archaeology."    
//         ]
//     },
//     "Architecture": {
//         "desc": "Architecture involves the planning, design, and construction of buildings and structures that are functional, aesthetically pleasing, and sustainable.
//         The scope for architects includes opportunities in architectural firms, construction companies, urban planning agencies, real estate development firms, and government organizations.",
//         "path": [
//             "Pursue a Bachelor's degree in Architecture (B.Arch) from a recognized architecture school or university accredited by the National Architectural Accrediting Board (NAAB) or similar accrediting body in your country.
//             "Develop skills in architectural drawing, drafting, 3D modeling, and visualization software such as AutoCAD, Revit, SketchUp, and Adobe Creative Suite.

//              Bachelor's Degree :Consider pursuing a Master's degree in Architecture (M.Arch) or a related field to deepen your knowledge, develop specialized expertise, and enhance your design skills.
             
//              Upon completion of your Bachelor's degree, pursue licensure as an architect by passing the Architect Registration Examination (ARE) administered by the National Council of Architectural Registration Boards (NCARB) or the relevant licensing authority in your country"    
//         ]
//     },
//     "Auditor": {
//         "desc": "Auditors are professionals responsible for examining financial records, ensuring compliance with regulations, and providing assurance on the accuracy of financial statements.
//         The scope for auditors includes opportunities in public accounting firms, corporate finance departments, government agencies, non-profit organizations, and consulting firms.",
//         "path": [
//             "Pursue a Bachelor's degree in Accounting, Finance, Business Administration, or a related field from an accredited university.
//             "Focus on courses covering auditing principles, financial accounting, managerial accounting, taxation, and business law.
             
//              Bachelor's Degree :Pursue a Bachelor's degree in Computer Science, Data Science, Artificial Intelligence, or a related field from a reputable university.
//              Gain hands-on experience by working on AI/ML projects, either individually or as part of academic coursework.
//              Participate in hackathons, competitions, or research projects related to AI/ML to apply theoretical knowledge in real-world scenarios.
            
//              Advanced Studies and Specialization:Consider pursuing a Master's degree or higher education in AI/ML for in-depth knowledge and specialization.
            
//              Certifications and Skills:Obtain certifications in AI/ML from reputable organizations or platforms like Coursera, edX, or Udacity to validate your skills.
//              Develop proficiency in tools and libraries commonly used in AI/ML such as TensorFlow, PyTorch, scikit-learn, and Keras.
             
//              Exams and Competitions:Prepare for competitive exams like GRE (Graduate Record Examination) or GATE (Graduate Aptitude Test in Engineering) if planning to pursue higher education abroad or in India, respectively.
//              Participate in AI/ML competitions such as Kaggle competitions to showcase your skills and learn from real-world datasets and challenges."    
//         ]
//     },
//     "Banker": {
//         "desc": "Banking involves managing financial transactions, providing financial services, and advising clients on various banking products and services.
//         The scope for bankers includes opportunities in retail banking, corporate banking, investment banking, wealth management, and financial analysis.",
//         "path": [
//             "Pursue a Bachelor's degree in Finance, Economics, Business Administration, Accounting, or a related field from a reputable university.
//             "Focus on courses covering financial management, banking principles, accounting, economics, and business law.
             
//              Internships and Practical Experience:Seek internships or entry-level positions at banks, financial institutions, or credit unions to gain practical experience in banking operations, customer service, and financial analysis.
//              Consider specializing in specific areas of banking such as retail banking, commercial banking, investment banking, private banking, or risk management based on your interests and career goals.
            
//              Certifications and Skills:Consider obtaining certifications such as Certified Financial Planner (CFP), Chartered Financial Analyst (CFA), or Certified Bank Auditor (CBA) to enhance your credibility and marketability in the banking industry.
//              Participate in training programs or workshops offered by banking associations, regulatory bodies, or professional organizations to acquire additional skills and knowledge relevant to banking.
             
//              Exams and Competitions:while there are no universal exams required for a career in banking, certain certifications and licenses can enhance your qualifications. These include the Certified Financial Planner (CFP), Chartered Financial Analyst (CFA), Certified Bank Auditor (CBA), and various securities licensing exams such as Series 6, 7, 63, and 65. Completing relevant banking and finance courses can also provide valuable knowledge and skills. "    
//         ]
//     },
//     "Business Analyst": {
//         "desc": "Business Analysts are professionals who identify business needs, analyze processes, gather requirements, and recommend solutions to help organizations achieve their objectives.
//         The scope for business analysts includes opportunities in various industries such as IT, finance, healthcare, retail, and consulting.",
//         "path": [
//             "Pursue a Bachelor's degree in Business Administration, Management Information Systems (MIS), Computer Science, Economics, or a related field from a reputable university.
//             "Focus on courses covering business analysis principles, data analysis, project management, business process modeling, and communication skills.
             
//              Internships and Practical Experience:Seek internships or entry-level positions in business analysis, project management, or consulting firms to gain practical experience and exposure to real-world projects.
//              Develop proficiency in data analysis tools such as Microsoft Excel, SQL, Tableau, or Power BI to analyze and visualize data for decision-making purposes.
            
//              Certifications and Skills:Consider obtaining certifications such as Certified Business Analysis Professional (CBAP), Entry Certificate in Business Analysis (ECBA), or Agile Analysis Certification (IIBA-AAC) to enhance your credibility and marketability as a business analyst.
             
//              Exams and Competitions:For the Entry Certificate in Business Analysis (ECBA) certification, you'll need to pass the ECBA exam, which assesses foundational knowledge and understanding of business analysis concepts.
//              Other relevant exams include the Agile Analysis Certification (IIBA-AAC) exam for professionals specializing in Agile methodologies."    
//         ]
//     },
//     "Business Management": {
//         "desc": "Business Management involves planning, organizing, leading, and controlling resources to achieve organizational goals effectively.
//         The scope for business managers includes opportunities in various industries such as marketing, finance, human resources, operations, and entrepreneurship.",
//         "path": [
//             "Pursue a Bachelor's degree in Business Administration (BBA), Management, Economics, or a related field from a reputable university.
//             "Focus on courses covering business management principles, organizational behavior, marketing, finance, strategic management, and leadership.
             
//              Internships and Practical Experience:Seek internships or entry-level positions in companies across different sectors to gain practical experience and exposure to various aspects of business operations.

//              Graduate Studies and Advanced Education:
//              Consider pursuing a Master's degree in Business Administration (MBA) or a specialized master's program in areas such as finance, marketing, operations, or entrepreneurship to deepen your knowledge and advance your career in business management.
             
//              Certifications and Skills:Consider obtaining certifications such as Project Management Professional (PMP), Certified ScrumMaster (CSM), or Six Sigma Green Belt to enhance your management skills and marketability.
             
//              Exams and Competitions:Prepare for exams such as the PMP exam administered by the Project Management Institute (PMI) for certification as a project manager, or the Six Sigma certification exams offered by organizations like ASQ or IASSC for proficiency in process improvement methodologies."    
//         ]
//     },
//     "Chartered Accountant": {
//         "desc": "Chartered Accountants (CAs) are professionals specialized in accounting, auditing, taxation, and financial management.
//         The scope for CAs includes opportunities in public accounting firms, corporate finance departments, government agencies, consulting firms, and academia.",
//         "path": [
//             "Enroll in a recognized Chartered Accountancy (CA) program offered by a professional accounting body or institute accredited by the Institute of Chartered Accountants of your country (e.g., ICAI in India).
//             " 
//              Internships and Practical Experience:Undergo mandatory articleship training, which involves practical work experience under the supervision of a practicing Chartered Accountant.
//              Gain hands-on experience in accounting, auditing, taxation, and financial management during the articleship period, which varies in duration depending on the regulations of the accounting body.
            
//              Certifications and Skills:Consider obtaining additional certifications such as Certified Public Accountant (CPA), Chartered Financial Analyst (CFA), or Certified Management Accountant (CMA) to further enhance your credentials and career opportunities.
             
//              Exams and Competitions:Prepare for and pass the Final Examination, which is divided into two groups covering advanced topics in accounting, auditing, taxation, financial reporting, strategic management, and information technology."    
//         ]
//     },
//     "Chemist": {
//         "desc": "Chemists are professionals who study the composition, properties, and reactions of substances to develop new products, improve existing processes, and solve scientific problems.
//         The scope for chemists includes opportunities in research laboratories, pharmaceutical companies, chemical manufacturing firms, environmental agencies, government organizations, and academic institutions.",
//         "path": [
//             "Pursue a Bachelor's degree in Chemistry or a related field from a reputable university or college.
//             "Focus on courses covering general chemistry, organic chemistry, inorganic chemistry, analytical chemistry, physical chemistry, and laboratory techniques.
             
//              Internships and Practical Experience:Seek internships or part-time positions in research laboratories, pharmaceutical companies, or chemical industries to gain practical experience in laboratory techniques, data analysis, and scientific research.
//              Develop proficiency in laboratory techniques such as titration, chromatography, spectroscopy, and microscopy for chemical analysis and experimentation.
            
//              Certifications and Skills:Develop proficiency in laboratory techniques such as titration, chromatography, spectroscopy, and microscopy for chemical analysis and experimentation.
             
//              Exams and Competitions:Depending on the country and specific career path, relevant exams may include standardized tests for admission to undergraduate or graduate programs in chemistry.
//              Certifications such as Certified Professional Chemist (CPC) or Certified Laboratory Analyst (CLA) may be obtained through professional organizations or industry-specific certification boards"    
//         ]
//     },
//     "Choreographer ": {
//         "desc": "Choreographers are professionals who create and design dance sequences, movements, and routines for performances, shows, music videos, films, and stage productions.
//         The scope for choreographers includes opportunities in the entertainment industry, including theaters, dance companies, television shows, music videos, films, cruise ships, theme parks, and educational institutions.",
//         "path": [
//             "While formal education is not mandatory, pursuing a Bachelor's degree in Dance, Performing Arts, Fine Arts, or a related field from a reputable institution can provide valuable training and education in dance techniques, styles, history, and performance skills.
//             " 
//              Practical Experience:Gain practical experience by participating in dance performances, competitions, recitals, and showcases to hone your skills as a dancer and choreographer.
//              Develop proficiency in various dance styles and techniques, including choreographing movements, creating formations, transitions, and storytelling through dance.
            
//              Certifications and Skills:Consider pursuing certifications or advanced training programs in choreography, dance education, or production management to enhance your skills and credentials in the field."    
//         ]
//     },
//     "Civil Engineer": {
//         "desc": "Civil Engineers are professionals who design, construct, maintain, and manage infrastructure projects such as buildings, bridges, roads, dams, and water supply systems.
//         The scope for civil engineers includes opportunities in various sectors including construction, infrastructure development, environmental engineering, transportation, and urban planning.",
//         "path": [
//             "Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science.
// "
//             Bachelor's Degree:Pursue a Bachelor's degree in Civil Engineering from a reputable university or college accredited by the relevant professional engineering body in your country.
//             Focus on courses covering core subjects such as structural engineering, geotechnical engineering, transportation engineering, water resources engineering, construction management, and environmental engineering.
             
//              Internships and Practical Experience:Seek internships or co-op placements with engineering firms, construction companies, government agencies, or consulting firms to gain practical experience and exposure to real-world projects.
//              Develop proficiency in engineering software tools such as AutoCAD, Revit, Civil 3D, SAP2000, ETABS, or STAAD.Pro for design, analysis, and modeling of civil engineering structures and systems.
            
//              Certifications and Skills:Obtain professional engineering licensure or certification from the relevant engineering regulatory body in your country. This typically involves passing the Fundamentals of Engineering (FE) exam and the Professional Engineering (PE) exam after gaining relevant work experience.
             
//              Exams and Competitions:Prepare for entrance exams required for admission to engineering programs, such as the Joint Entrance Examination (JEE) in India or the SAT in the United States."    
//         ]
//     },
//     "Civil Services": {
//         "desc": "Civil Services involve working for the government in administrative, diplomatic, law enforcement, and regulatory roles.
//         The scope of civil services includes opportunities to serve in various government departments, agencies, and ministries at local, state, and national levels.",
//         "path": [
//             "Obtain a Bachelor's degree in any discipline from a recognized university. While there is no specific degree requirement for Civil Services, having a strong educational background is beneficial.
//             "            
//             Preparing for Civil Services Exams:Civil Services exams are highly competitive and require thorough preparation.Start by understanding the exam pattern, syllabus, and eligibility criteria for the Civil Services Examination (CSE) conducted by the respective country's civil services commission.
             
//              Practical Experience:Develop strong analytical and critical thinking skills to analyze complex issues, policies, and legislation.
            
//              Certifications and Skills:While there are no specific certifications required for Civil Services, candidates may consider participating in training programs, workshops, or leadership development courses to enhance their skills and knowledge in governance, public administration, and policy analysis.
             
//              Exams and Competitions:it's the UPSC Civil Services Exam, comprising Preliminary, Main, and Interview stages. In the United States, exams differ by agency, including the Federal Civil Service Exam and Foreign Service Officer Test."    
//         ]
//     },
//     "Company Secretary": {
//         "desc": "Company Secretaries play a pivotal role in ensuring regulatory compliance and governance within companies.
//         They handle legal and corporate matters, facilitate board meetings, ensure compliance with statutory requirements, and advise on corporate governance practices.",
//         "path": [
//             "Pursue a Bachelor's degree in Commerce, Business Administration, Economics, or any related field from a recognized university.
//             "Complete the Foundation Course offered by the Institute of Company Secretaries of India (ICSI) after 10+2 or its equivalent.
                        
//             Foundation Course:Register for and complete the Foundation Course, which covers basic concepts of business, economics, accounting, and corporate law.
             
//              Practical Experience:Gain hands-on experience in secretarial practices, corporate law compliance, corporate governance, legal documentation, and other related areas.
             
//              Certifications and Skills:Upon passing the Final Examination and completing the required practical training, apply for Associate Membership of ICSI.
//              Become a certified Company Secretary and gain membership status with the professional body upon approval
             
//              Exams and Competitions:Exams include the Foundation, Executive, and Professional Programme examinations conducted by ICSI or the relevant regulatory body in your country."    
//         ]
//     },
//     "Computer Applications": {
//         "desc": "Computer Applications involve the use of computer software and technology to solve practical problems and enhance productivity in various fields.
//         The scope for computer applications professionals includes opportunities in software development, web development, mobile app development, database management, system analysis, and computer networking.",
//         "path": [
//             "Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science.
//             "            
//             Bachelor's Degree:Pursue a Bachelor's degree in Computer Applications (BCA) or a related field such as Computer Science, Information Technology, or Software Engineering from a recognized university or college.
//             Focus on courses covering programming languages, software development methodologies, database management systems, web technologies, and computer networking.
             
//              Internships and Practical Experience:Gain practical experience by working on software development projects, internships, or co-op placements with software companies, IT firms, or research institutions.
//              Learn programming languages such as Java, Python, C++, JavaScript, or SQL, depending on the area of interest and career goals.
            
//              Certifications and Skills:Consider obtaining professional certifications in specific technologies or platforms relevant to your career interests, such as Oracle Certified Associate (OCA), Microsoft Certified Solutions Developer (MCSD), or AWS Certified Developer Associate..
             
//              Exams and Competitions:Prepare for entrance exams required for admission to engineering programs, such as the Joint Entrance Examination (JEE) in India or the SAT in the United States."    
//         ]
//     },
//     "Computer Engineer": {
//         "desc": "Computer Engineering involves the design, development, and maintenance of computer hardware and software systems.
//         The scope for computer engineers includes opportunities in areas such as hardware design, software development, embedded systems, robotics, cybersecurity, and artificial intelligence.",
//         "path": [
//             "Choose the Science stream in Higher Secondary (HSC) education with subjects like Mathematics, Physics, and Computer Science.
//             "            
//             Bachelor's Degree:Pursue a Bachelor's degree in Computer Engineering, Computer Science, Electrical Engineering, or a related field from a reputable university or college.
             
//              Internships and Practical Experience:Seek internships or co-op placements with technology companies, IT firms, research institutions, or government agencies to gain practical experience and exposure to real-world projects.
//              Develop proficiency in programming languages such as C, C++, Java, Python, or JavaScript for software development and system programming.
            
//              Certifications and Skills:Consider obtaining professional certifications in specific technologies or platforms relevant to your career interests, such as Cisco Certified Network Associate (CCNA), Microsoft Certified Solutions Associate (MCSA), or Certified Information Systems Security Professional (CISSP).
             
//              Exams and Competitions:Prepare for competitive exams like GRE (Graduate Record Examination) or GATE (Graduate Aptitude Test in Engineering) if planning to pursue higher education abroad or in India, respectively."    
//         ]
//     },
//     "Content Writer": {
//         "desc": "Content Writers create written material for various mediums such as websites, blogs, social media, marketing materials, and more.
//         The scope for Content Writers includes opportunities in digital marketing agencies, advertising firms, publishing houses, corporate communications departments, and freelance writing.",
//         "path": [
//             "Pursue a Bachelor's degree in English, Journalism, Communications, Marketing, or a related field from a recognized university or college.
//             "Focus on courses covering writing skills, journalism principles, digital media, marketing communication, and content strategy.
                        
//             Bachelor's Degree:Pursue a Bachelor's degree in English, Journalism, Communications, Marketing, or a related field from a recognized university or college.
//             Focus on courses covering writing skills, journalism principles, digital media, marketing communication, and content strategy.
//             Develop strong writing skills with a focus on clarity, creativity, and audience engagement.
             
//              Certifications and Skills:Consider obtaining certifications in content marketing, copywriting, SEO copywriting, or digital marketing to enhance your skills and credibility as a Content Writer.
//              Participate in writing workshops, online courses, and industry conferences to learn new techniques, tools, and best practices in content creation and marketing."    
//         ]
//     },
//     "Copywriter": {
//         "desc": "Copywriters are responsible for creating compelling and persuasive content used in advertising, marketing, and promotional materials.
//         The scope for copywriters includes opportunities in advertising agencies, marketing firms, digital media companies, corporate communications departments, and freelance projects.",
//         "path": [
//             "Complete your secondary education (SSC) with a focus on language skills, literature, and writing proficiency. Strong command over languages, grammar, and vocabulary is essential for a career in content writing.
//             "            
//             Bachelor's Degree:Pursue a Bachelor's degree in English, Journalism, Communications, Marketing, Advertising, or a related field from a recognized university or college. Strong writing, research, and communication skills are essential for this career.
//             Improve creativity, critical thinking, problem-solving abilities, and attention to detail to develop unique and impactful copy that resonates with consumers and drives desired actions.
             
//              Certifications and Skills:Consider obtaining certifications in copywriting, content marketing, digital marketing, or advertising from reputable organizations or professional associations to enhance your credibility and skills as a copywriter."    
//         ]
//     },
//     "Customer Service Executive": {
//         "desc": "Customer Service Executives play a crucial role in addressing customer inquiries, resolving issues, and providing assistance to ensure customer satisfaction.
//         The scope for Customer Service Executives includes opportunities in various industries such as retail, hospitality, telecommunications, banking, e-commerce, and healthcare.",
//         "path": [
//             "Complete your secondary education (SSC) with a focus on communication skills, problem-solving abilities, and interpersonal skills.
//             "            
//             Bachelor's Degree:While a specific degree may not be required, having a diploma or Bachelor's degree in fields such as Business Administration, Communications, Hospitality Management, or related areas can be beneficial.
             
//              Internships and Practical Experience:Seek internships or entry-level positions in customer service roles to gain practical experience and exposure to customer interactions, problem-solving scenarios, and service delivery processes.
            
//              Certifications and Skills:Enroll in customer service training programs or workshops offered by professional organizations, vocational schools, or online platforms to learn about best practices, communication techniques, and customer handling skills.
//              Consider obtaining certifications such as Certified Customer Service Professional (CCSP) or Customer Service Excellence Certification to demonstrate your expertise and commitment to customer service excellence.
             
//              Exams and Competitions:Exams required to become a Customer Service Executive typically include any relevant certification exams offered by professional organizations, such as the Certified Customer Service Professional (CCSP) exam"    
//         ]
//     },
//     "Data Scientist": {
//         "desc": "Data Scientists analyze and interpret complex data to inform business decisions, identify trends, and drive strategic initiatives across various industries.
//         The scope for data scientists is broad, with opportunities in finance, healthcare, e-commerce, technology, marketing, and more, as organizations increasingly rely on data-driven insights.",
//         "path": [
//             "Complete secondary education (SSC) with a strong foundation in mathematics, statistics, computer science, and programming languages such as Python, R, or SQL.
//             "            
//             Bachelor's Degree:Pursue a Bachelor's degree in Computer Science, Statistics, Mathematics, Engineering, Economics, or a related field from a recognized university or college.
//             Develop proficiency in programming languages commonly used in data science, such as Python, R, or SQL, for data manipulation, analysis, and visualization.
             
//              Internships and Practical Experience:Gain hands-on experience with real-world data science projects, either through internships, co-op placements, research projects, or personal projects.
//              Engage with the data science community, share knowledge, collaborate on projects, and participate in data science meetups, conferences, and networking events to expand your network and stay informed about industry trends and opportunities.
            
//              Certifications and Skills:Obtain industry-recognized certifications such as IBM Data Science Professional Certificate, Google Data Analytics Professional Certificate, or Microsoft Certified: Azure Data Scientist Associate.
             
//              Exams and Competitions:Prepare for competitive exams like GRE (Graduate Record Examination) or GATE (Graduate Aptitude Test in Engineering) if planning to pursue higher education abroad or in India, respectively."    
//         ]
//     },
//     "Database Administration": {
//         "desc": "Database Administrators (DBAs) are responsible for managing, securing, and optimizing databases to ensure efficient data storage, retrieval, and management.
//         The scope for database administrators includes opportunities in various industries such as finance, healthcare, e-commerce, technology, and government, where databases are critical for storing and accessing organizational data.",
//         "path": [
//             "Complete secondary education (SSC) with a strong foundation in mathematics, statistics, computer science, and programming languages such as Python, R, or SQL.
//             "            
//             Bachelor's Degree:Pursue a Bachelor's degree in Computer Science, Statistics, Mathematics, Engineering, Economics, or a related field from a recognized university or college.
//             Develop proficiency in programming languages commonly used in data science, such as Python, R, or SQL, for data manipulation, analysis, and visualization.
             
//              Internships and Practical Experience:Gain hands-on experience with real-world data science projects, either through internships, co-op placements, research projects, or personal projects.
            
//              Certifications and Skills:Obtain industry-recognized certifications such as Oracle Certified Professional (OCP), Microsoft Certified: Azure Database Administrator Associate, IBM Certified Database Administrator, or AWS Certified Database - Specialty.
             
//              Exams and Competitions:Prepare for competitive exams like GRE (Graduate Record Examination) or GATE (Graduate Aptitude Test in Engineering) if planning to pursue higher education abroad or in India, respectively."    
//         ]
//     },
//     "Dental ": {
//         "desc": "Dentists diagnose, prevent, and treat various dental and oral health issues, including tooth decay, gum disease, and oral infections.
//         The scope for dentists includes opportunities in private practice, hospitals, community health centers, government agencies, and academic institutions.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on science subjects such as biology, chemistry, and physics.
//             "Pursue a Bachelor's degree in Pre-Dentistry, Biology, Chemistry, or a related field from a recognized university or college.
                        
//             Dental Admission Test (DAT):Prepare for and take the Dental Admission Test (DAT), which is required for admission to most dental schools. The DAT assesses your academic ability, scientific knowledge, and perceptual ability.
//             Excellent communication and interpersonal skills to interact with patients and colleagues effectively.
             
//             Licensing Exams:Pass the National Board Dental Examination (NBDE) or a state-specific licensing exam to become a licensed dentist. Requirements vary by state, so research the licensing process in your desired location.
            
//             Exams and Competitions:Exams required to become a dentist include the Dental Admission Test (DAT) for dental school admission, the National Board Dental Examination (NBDE) for licensure, and regional or state-specific licensing exams. Optional specialty board exams are available for dentists pursuing specialization."    
//         ]
//     },
//     "Surgeon ": {
//         "desc": "Surgeons are medical doctors who specialize in performing surgical procedures to treat injuries, diseases, and medical conditions. They work in hospitals, clinics, and surgical centers, addressing a wide range of medical issues.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on science subjects such as biology, chemistry, and physics.
//             "Pursue a Bachelor's degree in Pre-Medical Studies, Biology, Chemistry, or a related field from a recognized university or college.
                        
//             Medical College Admission Test (MCAT):
//             Prepare for and take the Medical College Admission Test (MCAT), which is required for admission to medical school. The MCAT assesses knowledge in biological and physical sciences, critical thinking, and problem-solving skills.
             
//             Licensing Exams:Pass the United States Medical Licensing Examination (USMLE) for MD graduates or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX-USA) for DO graduates. These exams assess medical knowledge and clinical skills.
            
//             Exams and Competitions:To become a surgeon, candidates must first pass the Medical College Admission Test (MCAT) for admission to medical school.Surgeons may pursue board certification through exams administered by organizations like the American Board of Surgery (ABS) and may opt for specialty-specific exams for further specialization."    
//         ]
//     },
//     "Doctor ": {
//         "desc": "Doctors are healthcare professionals responsible for diagnosing, treating, and preventing illnesses, injuries, and medical conditions in patients of all ages.
//         They work in various healthcare settings, including hospitals, clinics, private practices, and community health centers, and may specialize in areas such as internal medicine, surgery, pediatrics, obstetrics and gynecology, psychiatry, or family medicine.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on science subjects such as biology, chemistry, and physics.
//             "Pursue a Bachelor's degree in Pre-Medical Studies, Biology, Chemistry, or a related field from a recognized university or college.
                        
//             Medical College Admission Test (MCAT):
//             Prepare for and take the Medical College Admission Test (MCAT), which is required for admission to medical school. The MCAT assesses knowledge in biological and physical sciences, critical thinking, and problem-solving skills.
             
//             Licensing Exams:Pass the United States Medical Licensing Examination (USMLE) for MD graduates or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX-USA) for DO graduates. These exams assess medical knowledge and clinical skills.
            
//             Exams and Competitions:Candidates must first pass the Medical College Admission Test (MCAT) for admission to medical school.Surgeons may pursue board certification through exams administered by organizations like the American Board of Surgery (ABS) and may opt for specialty-specific exams for further specialization."    
//         ]
//     },
//     "Electrical Engineer  ": {
//         "desc": "Electrical engineers design, develop, and maintain electrical systems, equipment, and devices used in various industries such as power generation, telecommunications, electronics, and manufacturing.",
//         "path": [
//             "Complete secondary education (SSC) with a strong foundation in mathematics and physics.
//             "Pursue a Bachelor's degree in Electrical Engineering or a related field from an accredited university or college.
                        
//             Internships and Co-op Programs:
//             Gain practical experience through internships or co-op programs with engineering firms, electrical utilities, or manufacturing companies.
//             Internships provide hands-on experience and networking opportunities.
             
//             Professional Licensure:Obtain a Professional Engineer (PE) license to practice as an electrical engineer. Licensure requirements vary by state but typically include completing a bachelor's degree, gaining relevant work experience, and passing the Fundamentals of Engineering (FE) exam and the Principles and Practice of Engineering (PE) exam.
            
//             Exams and Competitions:Fundamentals of Engineering (FE) Exam: The FE exam is the first step toward earning a PE license. It assesses fundamental engineering knowledge and is typically taken during the final year of undergraduate studies.
//             Principles and Practice of Engineering (PE) Exam: The PE exam is the second step toward earning a PE license. It assesses engineering knowledge in a specific discipline, such as electrical engineering, and is taken after gaining relevant work experience."    
//         ]
//     },
//     "Electrical Engineer  ": {
//         "desc": "Electrical engineers design, develop, and maintain electrical systems, equipment, and devices used in various industries such as power generation, telecommunications, electronics, and manufacturing.",
//         "path": [
//             "Complete secondary education (SSC) with a strong foundation in mathematics and physics.
//             "Pursue a Bachelor's degree in Electrical Engineering or a related field from an accredited university or college.
                        
//             Internships and Co-op Programs:
//             Gain practical experience through internships or co-op programs with engineering firms, electrical utilities, or manufacturing companies.
//             Internships provide hands-on experience and networking opportunities.
             
//             Professional Licensure:Obtain a Professional Engineer (PE) license to practice as an electrical engineer. Licensure requirements vary by state but typically include completing a bachelor's degree, gaining relevant work experience, and passing the Fundamentals of Engineering (FE) exam and the Principles and Practice of Engineering (PE) exam.
            
//             Exams and Competitions:Fundamentals of Engineering (FE) Exam: The FE exam is the first step toward earning a PE license. It assesses fundamental engineering knowledge and is typically taken during the final year of undergraduate studies.
//             Principles and Practice of Engineering (PE) Exam: The PE exam is the second step toward earning a PE license. It assesses engineering knowledge in a specific discipline, such as electrical engineering, and is taken after gaining relevant work experience."    
//         ]
//     },
//     "Electronics Engineer": {
//         "desc": "Electronics engineers design, develop, test, and supervise the manufacture of electronic equipment and systems. They work with a wide range of technologies, including semiconductors, circuits, microprocessors, and telecommunications equipment.",
//         "path": [
//             "Complete secondary education (SSC) with a strong foundation in mathematics and physics.
//             "Pursue a Bachelor's degree in Electronics Engineering or a related field from an accredited university or college.
                        
//             Internships and Co-op Programs:
//             Gain practical experience through internships or co-op programs with electronics companies, engineering firms, or research institutions.
//             Internships provide hands-on experience and exposure to real-world projects.
             
//             Professional Licensure:Pursue certifications in specialized areas such as digital design, embedded systems, or telecommunications to enhance your credentials and career prospects.
//             Relevant certifications may be offered by professional organizations or industry associations.
            
//             Exams and Competitions:While specific exams may vary depending on location and industry, relevant exams for electronics engineers may include professional engineering (PE) exams for licensure or industry-specific certification exams."    
//         ]
//     },
//     "Event Management ": {
//         "desc": "Event managers plan, organize, and execute various types of events, including conferences, weddings, concerts, corporate meetings, and festivals.
//         They coordinate all aspects of an event, including budgeting, scheduling, venue selection, vendor management, marketing, and on-site coordination.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on subjects such as business studies, communication, marketing, and hospitality management.
//             "While a formal degree is not always required, pursuing a Bachelor's degree in Event Management, Hospitality Management, Business Administration, or Marketing can provide valuable knowledge and skills.
                        
//             Internships and Co-op Programs:
//             Gain practical experience through internships or entry-level positions with event planning companies, hospitality businesses, or event venues.
//             Internships provide valuable hands-on experience and networking opportunities in the industry.
             
//             Professional Licensure:Consider pursuing certifications such as Certified Meeting Professional (CMP) or Certified Special Events Professional (CSEP) to enhance your credentials and demonstrate expertise in event management.
            
//             Exams and Competitions:While there are no specific exams required to become an event manager, certifications such as CMP or CSEP may require passing an exam to obtain certification."    
//         ]
//     },
//     "Fashion Designer  ": {
//         "desc": "Fashion designers create clothing, accessories, and footwear, following trends, styles, and consumer preferences. They conceptualize designs, sketch ideas, select fabrics, and oversee the production process.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on art, design, and textiles.
//             "Pursue a Bachelor's degree in Fashion Design or a related field from a reputable design school or university.
                        
//             Internships and Co-op Programs:Gain practical experience through internships with fashion houses, design studios, or clothing manufacturers.
//             Internships provide valuable industry exposure, networking opportunities, and hands-on experience in the design process.
             
//             Certifications:While not always required, certifications such as Certified Fashion Designer (CFD) or Certified Apparel Production Professional (CAPP) can enhance credibility and demonstrate expertise in fashion design.Professional Licensure:Consider pursuing certifications such as Certified Meeting Professional (CMP) or Certified Special Events Professional (CSEP) to enhance your credentials and demonstrate expertise in event management.
            
//             Exams and Competitions:While there are no specific exams required to become an event manager, certifications such as CMP or CSEP may require passing an exam to obtain certification."    
//         ]
//     },
//     "Finance Consultant": {
//         "desc": "Fashion designers create clothing, accessories, and footwear, following trends, styles, and consumer preferences. They conceptualize designs, sketch ideas, select fabrics, and oversee the production process.",
//         "path": [
//             "Complete secondary education (SSC) with a focus on art, design, and textiles.
//             "Pursue a Bachelor's degree in Fashion Design or a related field from a reputable design school or university.
                        
//             Internships and Co-op Programs:Gain practical experience through internships with fashion houses, design studios, or clothing manufacturers.
//             Internships provide valuable industry exposure, networking opportunities, and hands-on experience in the design process.
             
//             Certifications:While not always required, certifications such as Certified Fashion Designer (CFD) or Certified Apparel Production Professional (CAPP) can enhance credibility and demonstrate expertise in fashion design.Professional Licensure:Consider pursuing certifications such as Certified Meeting Professional (CMP) or Certified Special Events Professional (CSEP) to enhance your credentials and demonstrate expertise in event management.
            
//             Exams and Competitions:While there are no specific exams required to become an event manager, certifications such as CMP or CSEP may require passing an exam to obtain certification."    
//         ]
//     },
//     "Technical Writer": {
//         "desc": "Technical writers are responsible for creating clear and concise documentation for technical products or processes, such as user manuals, guides, FAQs, and online help documentation. Technical writers are in demand across various industries, including software development, IT, healthcare, manufacturing, and finance.",
//         "path": [
//             "(HSC) Education: Completion of high school education is the basic requirement.",
//             ""Further Education: Pursue a bachelor's degree in fields such as English, Technical Communication, Journalism, Computer Science (with a focus on technical writing)", 
//             "Writing Skills and Documentation Tools : Ability to communicate complex information clearly and concisely; familiarity with tools like Microsoft Word, Adobe Acrobat, MadCap Flare, or Confluence.",
//             "Research Skills: Proficiency in researching and gathering information from various sources.",
//             "Technical Aptitude and Attention to Detail : Understanding of technical concepts and the ability to translate them into easily understandable language. Thoroughness in reviewing and editing documentation for accuracy and consistency.",
//             "Optional Certifications: While not mandatory, certifications can demonstrate your expertise and commitment to the field. Consider certifications like: Certified Professional Technical Communicator (CPTC), Adobe Certified Expert (ACE) in Technical Communication Software",
//             "Work on creating documentation for open-source projects, volunteer organizations, or internships to build a diverse portfolio. Include samples of user guides, manuals, tutorials, or online help documentation in your portfolio. Create a professional website or LinkedIn profile to showcase your portfolio and attract potential clients or employers.",
//             "Jobs Related to Web Design include Technical Writer, Content Developer, Instructional Designer, Documentation Manager."
//         ]
//     },
//     "Travel/Tourism Management": {
//         "desc": "A Travel/Tourism Manager is responsible for planning, organizing, and coordinating travel arrangements for individuals or groups. The travel and tourism industry is vast and includes opportunities in travel agencies, tour operators, airlines, hotels, resorts, and government tourism departments.",
//         "path": [
//             "(SSC) Education: Completion of high school education is the basic requirement.",
//             ""Further Education: Pursue a bachelor's degree in fields such as: Tourism Management, Hospitality Management, Business Administration with a focus on Tourism or Event Management",
//             "Internships: Gain practical experience through internships in travel agencies, tour operators, or hospitality organizations.",
//             "Customer Service and Organizational Skills: Excellent interpersonal and communication skills to interact with clients and provide exceptional service. Ability to plan and coordinate travel itineraries, accommodations, transportation, and activities.",
//             "Destination Knowledge, familiarity with popular tourist destinations, attractions, cultural norms, and travel regulations required. Problem-Solving & Sales and Marketing: Quick decision-making and problem-solving skills to handle unexpected situations or emergencies. Basic understanding of sales and marketing principles to promote travel packages and attract customers.",
//             " Courses and Training: Enroll in courses covering topics such as: Tourism Planning and Development, Tour Operations Management, Travel Agency Operations, Destination Marketing. Learn additional languages, especially those commonly spoken in tourist destinations, to communicate effectively with international clients. Technology Skills: Familiarize yourself with reservation systems, travel booking software, and online travel platforms.",
//             "Optional Certifications: While not mandatory, certifications can enhance your credibility and marketability. Consider certifications like: Certified Travel Associate (CTA), Certified Travel Counselor (CTC), Destination Specialist (DS), Cruise Line International Association (CLIA) Certification",
//             "Jobs Related to Travel/Tourism Management include: Travel Agent, Tour Operator, Event Planner, Destination Marketing Manager, Hotel Sales Manager."
//         ]
//     },
//     "Web Designer": {
//         "desc": "A web designer is responsible for creating the visual elements of websites, including layout, colors, fonts, and images. With the increasing demand for websites across various industries, web designers are in high demand. They work in design agencies, IT companies, freelance, or even in-house for businesses.",
//         "path": [
//             "(HSC) Education: Completion of high school education is the basic requirement.",
//             ""Further Education: Pursue a bachelor's degree in fields such as Web Design, Graphic Design, Multimedia Design, Computer Science (with a focus on web development/design)", 
//             "Online Courses: Platforms like Coursera, Udemy, and LinkedIn Learning offer courses in web design principles, HTML, CSS, JavaScript, and other relevant technologies.",
//             "Design Skills: Understanding of design principles, layout techniques, color theory, and typography.",
//             "Technical Skills: Proficiency in HTML, CSS, JavaScript, and responsive design.",
//             "Software Skills: Knowledge of design software like Adobe Photoshop, Illustrator, Sketch, or Figma.",
//             "Communication Skills: Ability to understand client requirements and communicate design ideas effectively",
//             "Projects and Online Presence: Work on personal projects, freelance gigs, or internships to build a diverse portfolio showcasing your skills and creativity. Create a professional website to display your portfolio and attract potential clients or employers.",
//             "Optional Certifications: While not mandatory, certifications can add credibility to your skills. Consider certifications like: Adobe Certified Expert (ACE) in Web Design and Google Web Designer Certification",
//             "Jobs Related to Web Design include UI/UX Designer, Front-end Developer, Graphic Designer, Art Director."
//         ]
//     },
// }